# GetRebarsInHost Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarHostData..::..GetRebarsInHost Method
RebarHostData Class See Also
---
Returns all Rebar elements hosted by the referenced element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Rebar> GetRebarsInHost()
```

Visual Basic
---
```text
Public Function GetRebarsInHost As IList(Of Rebar)
```

Visual C++
---
```text
public:
IList<Rebar^>^ GetRebarsInHost()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace